import postFullContent from '../../resources/components/post/post-full-content/post-full-content.vue'
import postComment from '../../resources/components/post/post-comment/post-comment.vue'
export default {
    name: 'posts-summary',
    data(){
        return {
            comments : [
                {
                    name: "سروش صفایی زاده",
                    date: "۲۸ تیر ۱۴۰۰",
                    time: "۷ دقیقه مطالعه",
                    text: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،`,
                    commentsReply: [
                        {
                            name: "سروش صفایی زاده",
                            date: "۲۸ تیر ۱۴۰۰",
                            time: "۷ دقیقه مطالعه",
                            text: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،`,
                        }
                    ]
                },
                {
                    name: "سروش صفایی زاده",
                    date: "۲۸ تیر ۱۴۰۰",
                    time: "۷ دقیقه مطالعه",
                    text: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،`,
                }
            ]
        }
    },
    components: {
        postFullContent,
        postComment
    }
}