<template>
    <section class="page-content">
        <article class="single-container js-button-action">
            <div class="post-content article-content">
                <h1>شرایط و مقررات استفاده از هلیوم</h1>
                <p>
                    شما در حالِ مطالعۀ شرایط و مقررات استفاده از هلیوم («شرایط استفاده») هستید.
                </p>
                <ul class="ul-bullet-style">
                    <li>
                        هلیوم یک بستر خصوصی انتشار محتوا (Microblog) است.
                    </li>
                    <li>
                        اگر در هلیوم شناسۀ کاربری ثبت کرده‌اید، «شرایط استفاده» بینِ شما و هلیوم به نشانی اینترنتی
                        Virgool.io به‌عنوانِ قراردادی بین شما و هلیوم برقرار است.
                    </li>
                    <li>
                        استفادۀ شما از هلیوم به‌منزلۀ پذیرشِ کاملِ «شرایط استفاده» است.
                    </li>
                    <li>
                        امکانِ تغییر در جزئیات یا کلیات «شرایط استفاده از هلیوم» وجود دارد. تغییرات در بسترِ زمان، به‌دلیلِ
                        اتفاق‌های پیش‌بینی‌نشده یا به‌منظورِ بهبودِ کیفیت ارائه خدمات اعمال می‌شوند. هر نوع تغییر در این
                        شرایط از طریق رایانامه به کاربران اعلام خواهد شد و پس از اعمالِ تغییرات و اطلاع‌رسانی از سوی هلیوم،
                        استفادۀ کاربران از هلیوم تابعِ متنِ به‌روزرسانی‌شده است.
                    </li>
                    <li>
                        در صورتی که دسترسی کاربران به هلیوم به دلایلی خارج از اختیار هلیوم میسر نباشد، هلیوم هیچ گونه
                        مسئولیتی نخواهد داشت.
                    </li>
                </ul>
                <div class="line-devider">
                    <hr class="line-devider">
                </div>
                <h1>شیوۀ کار</h1>
                <ul class="ul-bullet-style">
                    <li>
                        برای ثبتِ نوشته لازم است در هلیوم ثبت‌نام کرده باشید. در زمان ثبت‌نام، نام، نام کاربری، نشانی ایمیل
                        و یک رمز عبور از شما خواسته می‌شود تا بتوانید در زمان‌های بعدی به حساب کاربری‌تان دسترسی داشته باشید
                    </li>
                    <li>
                        درج اطلاعات درست در هنگام ثبت‌نام ضروری‌ست
                    </li>
                    <li>
                        کاربران می‌توانند از نام مستعار در زمان ثبت‌نام استفاده کنند، اما سایر اطلاعات می‌بایست واقعی باشد.
                    </li>
                    <li>
                        هر شخص فقط مجاز به داشتن یک حساب کاربری شخصی در هلیوم است.
                    </li>
                    <li>
                        هر زمان بخواهید می‌توانید هر نوشته را حذف یا کل حساب کاربری‌تان را غیرفعال کنید.
                    </li>
                </ul>
                <div class="line-devider">
                    <hr class="line-devider">
                </div>
                <h1>حقوق و مسئولیتها</h1>
                <ul class="ul-bullet-style">
                    <li>
                        حقوق معنوی و مادیِ نوشتۀ شما در هلیوم، متعلق به شماست. با این حال، با انتشار نوشته های خود در
                        هلیوم، به هلیوم اجازه نشر نوشته های خود را می دهید.
                    </li>
                    <li>
                        هلیوم خود را برابر حقوق معنوی و مادی نوشتۀ افراد مسئول می‌داند و برابرِ سرقت مطالبِ شما یا سرقتِ
                        مطالبِ دیگران توسط کاربران هلیوم از نویسندۀ اصلی حمایت می‌کند.
                    </li>
                    <li>
                        نقلِ مطالبِ دیگران از سوی کاربران، بدونِ ذکرِ منبع ممنوع است. در صورتِ اعتراضِ صاحبِ اصلیِ نوشته
                        (منبعِ اصلی) هلیوم می‌تواند مطلبِ منتشرشده را حذف کند.
                    </li>
                    <li>
                        مسئولیت حقوقی مطالب هر کاربر بر عهدۀ خود او است و هلیوم به‌عنوان یک بستر نشر محتوا، هیچ دخالتی در
                        نوشتۀ کاربرانش ندارد.
                    </li>
                    <li>
                        مسئولیت محتوایی که منتشر می‌کنید بر عهده‌ی شماست. بدین معنا که شما متوجه کلیه‌ی عواقب ناشی از آن،
                        شامل اعتماد دیگران به صحت محتوا، مسائل مربوط به حقوق مالکیت فکری و سایر مسائل و حقوق قانونی هستید.
                    </li>
                    <li>
                        اهانت به سایر کاربران، شخصیت‌ها، افراد مشهور، مقدسات و قوانین جمهوری اسلامی ایران ممنوع است. هلیوم
                        بر اساس دریافت گزارش از سایر کاربران، برابر نشر محتوای حساسیت‌برانگیز یا توهین‌آمیز در نظرات یا
                        پست‌ها، به محدود کردنِ شناسۀ کاربری یا در نهایت مسدودسازی آن اقدام خواهد کرد.
                    </li>
                    <li>
                        انتشار مطالب مجرمانه در هلیوم ممنوع است. کلیۀ مسوولیت‌های مربوط به انتشارِ مطالبِ مجرمانه در هلیوم
                        برعهدۀ کاربر است. هلیوم به محض اطلاع از انتشار مطالب مجرمانه، نسبت به حذف آنها اقدام خواهد کرد.
                    </li>
                    <li>
                        ما هرگز محتوای شما و اطلاعات شما را بدون کسب اجازه‌ی معتبر از شما به شخص یا نهادی ثالث نمی‌فروشیم.
                    </li>
                    <li>
                        اطلاعات شخصیِ شما به امانت در اختیار ماست. هلیوم این امانت را به هیچ‌وجه برای مقاصد تجاری استفاده
                        نخواهد کرد. هلیوم با توجه به همۀ اقتضائات، با تمام توان و ابزار قانونی، می‌کوشد از اطلاعات شخصی شما
                        حراست کند.
                    </li>
                    <li>
                        از نظرِ هلیوم، مطالب صرفاً تبلیغاتی یا تجاری که با انگیزۀ لینک‌سازی و دستکاری سئو ثبت می‌شود،
                        مصداقِ هرزنامه است. منتشرکنندگانِ هرزنامه تذکر دریافت می‌کنند و در صورتِ ادامۀ روند، شناسۀ کاربری
                        آنها به‌مدتِ دو هفته غیرفعال می‌شود. اصرار بر انتشارِ هرزنامه موجبِ غیرفعال‌شدنِ دائمی شناسۀ کاربر
                        خواهد شد.
                    </li>
                    <li>
                        هلیوم می تواند در کنار محتوای کاربر نمایش تبلیغات انجام دهد. همچنین کاربر اجازه استفاده از محتوای
                        ایجاد شده توسط خود در بستر هلیوم به منظور تبلیغ خدمات هلیوم را به هلیوم می دهد.
                    </li>
                    <li>
                        کاربر می تواند محتوای خود را پاک کند، با این حال ممکن است این محتوا تا مدت زمان مشخصی در سرورهای
                        هلیوم باقی بماند.
                    </li>
                    <li>
                        کاربران حق دسترسی یا تلاش برای دسترسی غیرمجاز به هلیوم نخواهند داشت. در صورت اثبات دسترسی غیرمجاز
                        کاربر به هلیوم، کاربر مسئول خسارات و... خواهد بود.
                    </li>
                    <li>
                        در صورتی که به دلایلی خارج از اختیار هلیوم، مانند هک شدن از طرف شخص ثالث، خسارتی در اثر استفاده از
                        سرویس هلیوم به کاربر وارد شود، هلیوم مسئول نخواهد بود.
                    </li>
                    <li>
                        عدم اعمال فوری هر یک از حقوق مصرح در این شروط و مقررات برای هلیوم از سوی هلیوم، به معنای اعراض از
                        حقوق نخواهد بود.
                    </li>
                    <li>
                        استفاده از هلیوم برای نمایش محتوای ناقض حقوق مالکیت فکری ممنوع است و در صورت نقض حقوق مالکیت فکری
                        ثالث توسط کاربر، کاربر مسئولیت جبران خسارت و مسئولیت قانونی را بر عهده خواهد داشت.
                    </li>
                </ul>
                <div class="line-devider">
                    <hr class="line-devider">
                </div>
                <h1>قوانین مربوط به نسخه صوتی</h1>
                <p>امکان افزودن نسخه صوتی، تنها برای خوانش متن طراحی شده است و محتوا باید با کلیت متن مطابقت داشته باشد.</p>
                <p>بعلاوه در نسخه صوتی باید موارد زیر رعایت گردد:</p>
                <ul class="ul-bullet-style">
                    <li>
                        مغایرت نداشتن محتوا با شئونات اخلاقی و عرف جامعه
                    </li>
                    <li>
                        نداشتن موسیقی غیرمجاز
                    </li>
                    <li>
                        عدم تمسخر لهجه و یا قومیت
                    </li>
                    <li>
                        اهانت آمیز نبودن به اقلیت‌های قومی و مذهبی
                    </li>
                    <li>
                        احترام به قومیت ها و اقلیت های مذهبی و دوری از تفرقه افکنی
                    </li>

                </ul>
                <div class="line-devider">
                    <hr class="line-devider">
                </div>
                <h1>امنیت</h1>
                <p>در صورتی که نقصی امنیتی در سرویس هلیوم مشاهده کردید، آن را با ما در میان بگذارید.</p>
            </div>
        </article>
    </section>
</template>

<style lang="scss">
.page-content,
.single-container,
.post-content {
    text-align: right;
    direction: rtl;
}

.h1-center {
    text-align: center;
}

.page-content {
    text-align: right;
    margin: 0 auto;
    max-width: 800px;
    padding: 20px;
}

.single-container {
    background-color: #f8f8f8;
    border-radius: 8px;
    padding: 20px;
    box-shadow: 0px 0px 10px rgba(0, 0, 0, 0.1);
}

.post-content {
    line-height: 1.6;
}

.h1-center {
    text-align: center;
}

.ul-bullet-style {
    list-style-type: none;
    padding-right: 20px;
}

.line-devider {
    text-align: center;
    margin: 20px 0;
}

.line-devider hr {
    border: none;
    height: 2px;
    background-color: #ccc;
    margin: 0;
}

</style>
